import { findUserByTelegramId, setUserState } from "../models/User.js";

export async function handleStart(bot, msg) {
  const telegramId = msg.from.id;
  const user = await findUserByTelegramId(telegramId);

  if (user?.state === "WAITING_CONFIRM") {
    return bot.sendMessage(
      msg?.chat?.id || msg?.message?.chat?.id,
      "У вас открыта заявка, чтобы продолжить нужно закрыть заявку"
    );
  }

  await setUserState(telegramId, "ROLE_SELECT");

  await bot.sendMessage(
    msg?.chat?.id || msg?.message?.chat?.id,
    "👋 Добро пожаловать в РаботаРядомБрест! \n\n Этот бот помогает быстро находить специалистов и работу в Бресте. \n\n 🔹 Нужен мастер, грузчик или перевозка? \n\n 🔹 Ищете работу или заказы рядом? \n\n Заявка сразу попадает к живым специалистам без посредников, звонков и сайтов. \n\n Вы сами выбираете, с кем работать: заказы и услуги для жителей Бреста, ремонт, перевозки, бытовые работы, помощь «муж на час» и многое другое. \n\n 👇 Выберите, кто вы:",
    {
      reply_markup: {
        inline_keyboard: [
          [{ text: "🔍 Ищу специалиста", callback_data: "role_client" }],
          [{ text: "🧑‍💼 Я специалист", callback_data: "role_specialist" }],
        ],
      },
    }
  );
}
